# Data Project 2021: School performance across Danish municipalities

The aim of the data project is to investigate primary school performance across Danish municipalities based on the grade point average obtained by the students at the final exam. We fetch data for performance of primary schools from the Danish Ministry of Children and Education. Futhermore, we fetch data from Statistics Denmark covering average income levels and shares of hihgly educated inhabitants in the Danish muncipalities. First, we read and clean the data sets in order to merge them into a single DataFrame. Then, we analyze the data and investigate whether there is positive correlation between income and education levels and the performance of primary schools across municipalities. 

**The project is organized as follows:**
1. Data project description
2. Reading and cleaning data 
3. Merging data 
4. Data analysis
6. Conclusion

**Group:** SSTL

**Members:** Louise Otte Arildsen (srb330), Signe Kolind (hmk792), Stine Fürst (qvj635) & Thomas Nielsen (qzw392)

**Imports and set magics:**

In [113]:
import pandas as pd
import matplotlib.pyplot as plt
import ipywidgets as widgets
from matplotlib_venn import venn2 # install with pip install matplotlib-venn

import pandas_datareader #!pip install pandas-datareader
import pydst #!pip install git+https://github.com/elben10/pydst

# autoreload modules when code is run
%load_ext autoreload
%autoreload 2

# local modules
import dataproject

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

# Read and clean data

## School performance data

**Reading and cleaning the data**<br>
We read the school data in ``Skoletal.xlsx`` obtained from [education statistics](https://uddannelsesstatistik.dk/Pages/Reports/1834.aspx) conducted by the Danish Ministry of Children and Education. The data set contains key indicators of performance for the primary schools in Denmark at municpality level. 
We clean the data by removing redundant columns and renaming the columns:

In [114]:
# a. load
school = pd.read_excel('Skoletal.xlsx', skiprows=2)

# b. drop columns
drop_these = ['Rækkenavne', 'Overgang 15 mdr ungdomsuddannelse fra 9 og 10 kl', 'Signifikant forskel', 'Forskel', 'Kompetencedækning']
school.drop(drop_these, axis=1, inplace=True)

# c. rename columns
school.rename(columns = {'Institution':'school', 'Skoleår':'year', 'Karaktergennemsnit_skoletal':'gpa', 'Socioøkonomisk reference':'socioeconomic', 'Andel med højest trivsel':'well-being', 'Samlet elevfravær':'absence', 'Elevtal':'students', 'Klassekvotient':'class'}, inplace=True)

The dataset now looks like this:

In [115]:
school.head()
#print(school.tail())

,school,year,gpa,socioeconomic,well-being,absence,students,class
0,Den Classenske Legatskole,2013/2014,8.2,7.8,NaN,NaN,500.0,24.95
1,Den Classenske Legatskole,København,8.2,7.8,NaN,NaN,500.0,24.95
2,Den Classenske Legatskole,2014/2015,7.6,7.5,0.906615,0.089829,521.0,24.90
3,Den Classenske Legatskole,København,7.6,7.5,0.906615,0.089829,521.0,24.90
4,Den Classenske Legatskole,2015/2016,8.2,8.0,0.956044,0.079799,515.0,24.90

**Seperate municipality and school year in column 'Year'**:<br>
In the data set every row is duplicated such that the data is the same in every column except from in column 'Year'. The column 'Year' alternately displays school year and municipality and we want to split this into two seperate columns.

In [116]:
#First we check the numbers of rows in the data set school:
print(f'The number of rows in data set school is = {len(school)}')

#Then we create a new variable 'municipality', which extract allmuncipality names from 'year'
municipality=pd.DataFrame(school['year'].iloc[1::2].values)

#We check that the number of municipality names are equal to half of the row lines. 
print(f'31328 divided by 2 = {len(school)/2}')
print(f'The number of rows in data set municipality is = {len(municipality)}')

#Then we delete every other ro (then ones containing municipalities in the column 'year'
res = [True, False] * 15664
school_new=school[res]
school_new.reset_index(drop=True, inplace=True)
print(f'The number of rows in data set school_new is = {len(school_new)}')

#We then merge school_new with municipalities and arrive at the solution
school_final = pd.concat([school_new, municipality], axis=1)
school_final.tail()
school_final.rename(columns = {school_final.columns[8]:'municipality'}, inplace=True)
school_final.head()

The number of rows in data set school is = 31328
31328 divided by 2 = 15664.0
The number of rows in data set municipality is = 15664
The number of rows in data set school_new is = 15664

,school,year,gpa,socioeconomic,well-being,absence,students,class,municipality
0,Den Classenske Legatskole,2013/2014,8.2,7.8,NaN,NaN,500.0,24.95,København
1,Den Classenske Legatskole,2014/2015,7.6,7.5,0.906615,0.089829,521.0,24.90,København
2,Den Classenske Legatskole,2015/2016,8.2,8.0,0.956044,0.079799,515.0,24.90,København
3,Den Classenske Legatskole,2016/2017,7.8,7.8,0.913669,0.072769,509.0,25.60,København
4,Den Classenske Legatskole,2017/2018,8.8,8.1,0.919540,0.081672,498.0,24.80,København

In [117]:
school_final.tail()

,school,year,gpa,socioeconomic,well-being,absence,students,class,municipality
15659,Vestermarkskolen Aars,2015/2016,NaN,NaN,1.0,0.094875,49.0,NaN,Vesthimmerlands
15660,Vestermarkskolen Aars,2016/2017,NaN,NaN,1.0,0.089781,50.0,NaN,Vesthimmerlands
15661,Vestermarkskolen Aars,2017/2018,NaN,NaN,NaN,NaN,49.0,NaN,Vesthimmerlands
15662,Vestermarkskolen Aars,2018/2019,NaN,NaN,NaN,0.082224,46.0,NaN,Vesthimmerlands
15663,Vestermarkskolen Aars,2019/2020,NaN,NaN,NaN,0.085611,47.0,NaN,Vesthimmerlands

**We then only want to investigate the year 2018/2019 and rename it to 2019, since that is the 'afgangsår':**

In [118]:
school_final["year"].replace({"2018/2019": "2019", "2019/2020": "2020"}, inplace=True)

def only_keep_oneyear(df):
    """ delete all year except 2018/2019
    Args:
        df (pd.DataFrame): pandas dataframe with the column "year" as a string

    Returns:
        df (pd.DataFrame): pandas dataframe

    """ 
    for val in ['2019']:
        
        I = df.year.str.contains(val)
        df = df.loc[I == True] # keep everything else
    
    return df

school_final.year.unique()

school = only_keep_oneyear(school_final)
school.head()

,school,year,gpa,socioeconomic,well-being,absence,students,class,municipality
5,Den Classenske Legatskole,2019,7.5,7.6,0.900000,0.071541,505.0,24.75,København
12,Nyboder Skole,2019,8.0,7.8,0.950495,0.073004,524.0,22.40,København
19,Sølvgades Skole,2019,7.4,7.6,0.901961,0.071107,467.0,23.45,København
26,Nørrebro Park Skole,2019,5.3,5.5,0.950331,0.069968,741.0,24.40,København
33,Blågård Skole,2019,4.2,5.0,0.876923,0.079616,588.0,21.32,København

**DataFrame for merging is gpa mean across muncipalities, we already know it is year 2019**

In [119]:
school_merge=school.groupby(['municipality'])['gpa'].mean().reset_index(name='gpa')
school_merge.head()

  municipality       gpa
0     Aabenraa  6.127814
1      Aalborg  7.013712
2       Aarhus  7.140788
3  Albertslund  6.063983
4      Allerød  7.965370

## Income level data

**Reading and cleaning the data**<br>
* Explain where the data is fetched from and how. 
* Briefly explain what the data contains
* Explain how you clean

In [120]:
Dst = pydst.Dst(lang='en') #

In [121]:
Dst.get_subjects()

    id                                       desc  active  hasSubjects
0   02                   Population and elections    True         True
1   04                  Labour, income and wealth    True         True
2   06                     Prices and consumption    True         True
3   05                          Living conditions    True         True
4   14  National accounts and government finances    True         True
5   03                    Education and knowledge    True         True
6   11                           Business sectors    True         True
7   07                 Business sector in general    True         True
8   16                    Money and credit market    True         True
9   13                           External economy    True         True
10  18                Culture and National Church    True         True
11  01          Geography, environment and energy    True         True
12  19                                      Other    True         True

In [122]:
tables = Dst.get_tables(subjects=['04'])
tables
tables[tables.id == 'INDKP101']

,id,text,unit,updated,firstPeriod,latestPeriod,active,variables
194,INDKP101,People,-,2020-11-27 08:00:00,1987,2019,True,"[region, unit, sex, type of income, time]"

In [123]:
indk_var = Dst.get_variables(table_id='INDKP101')
indk_var

indk_var = Dst.get_variables(table_id='INDKP101')
for id in ['OMRÅDE','ENHED','KOEN','INDKOMSTTYPE', 'Tid']:
    print(id)
    values = indk_var.loc[indk_var.id == id,['values']].values[0,0]
    for value in values:      
        #print(f' id = {value["id"]}, text = {value["text"]}')

SyntaxError: unexpected EOF while parsing (<ipython-input-123-ab8e024cbf25>, line 9)

In [133]:
variables = {'OMRÅDE':['*'],'ENHED':['116'],'KOEN':['MOK'],'INDKOMSTTYPE':['105'], 'Tid':['2019']}
inc_api = Dst.get_data(table_id = 'INDKP101', variables=variables)
display(inc_api)

,OMRÅDE,ENHED,KOEN,INDKOMSTTYPE,TID,INDHOLD
0,All Denmark,Average income for all people (DKK),"Men and women, total","2 Pre-tax Income, total (3+7+22+26+29)",2019,338122
1,Province Byen København,Average income for all people (DKK),"Men and women, total","2 Pre-tax Income, total (3+7+22+26+29)",2019,353203
2,Province Københavns omegn,Average income for all people (DKK),"Men and women, total","2 Pre-tax Income, total (3+7+22+26+29)",2019,388125
3,Province Nordsjælland,Average income for all people (DKK),"Men and women, total","2 Pre-tax Income, total (3+7+22+26+29)",2019,414861
4,Province Bornholm,Average income for all people (DKK),"Men and women, total","2 Pre-tax Income, total (3+7+22+26+29)",2019,291198
...,...,...,...,...,...,...
105,Rebild,Average income for all people (DKK),"Men and women, total","2 Pre-tax Income, total (3+7+22+26+29)",2019,345560
106,Mariagerfjord,Average income for all people (DKK),"Men and women, total","2 Pre-tax Income, total (3+7+22+26+29)",2019,312392
107,Jammerbugt,Average income for all people (DKK),"Men and women, total","2 Pre-tax Income, total (3+7+22+26+29)",2019,302417
108,Aalborg,Average income for all people (DKK),"Men and women, total","2 Pre-tax Income, total (3+7+22+26+29)",2019,310886
109,Hjørring,Average income for all people (DKK),"Men and women, total","2 Pre-tax Income, total (3+7+22+26+29)",2019,307772

In [134]:
inc_1=inc_api.drop(['KOEN','INDKOMSTTYPE','ENHED', 'TID'], axis=1)

inc_1.rename(columns = {'INDHOLD':'avg_income','OMRÅDE':'municipality'}, inplace=True)
display(inc_1)

                  municipality  avg_income
0                  All Denmark      338122
1      Province Byen København      353203
2    Province Københavns omegn      388125
3        Province Nordsjælland      414861
4            Province Bornholm      291198
..                         ...         ...
105                     Rebild      345560
106              Mariagerfjord      312392
107                 Jammerbugt      302417
108                    Aalborg      310886
109                   Hjørring      307772

[110 rows x 2 columns]

In [135]:
avg_inc=inc_1.groupby(by="municipality").sum()
avg_inc = avg_inc.drop("All Denmark", axis=0).reset_index()
avg_inc.head()

  municipality  avg_income
0     Aabenraa      305855
1      Aalborg      310886
2       Aarhus      327869
3  Albertslund      295184
4      Allerød      437980

## Education level data

**Reading and cleaning the data**<br>
* Explain where the data is fetched from and how. 
* Briefly explain what the data contains
* Explain how you clean

In [136]:
# List all subjects.
Dst.get_subjects()

# List all tables under the subject Education and knowledge which has the id 03\n",
table = Dst.get_tables(subjects=['03'])

#Choose the table \"HFUDD11: Befolkningens højest fuldførte uddannelse (15-69 år) efter bopælsområde, herkomst, højest fuldførte uddannelse, alder og køn\"\n",
table[table.id == 'HFUDD11']

# Get the variables in the dataset HFUDD11\n",
Edd_vars = Dst.get_variables(table_id='HFUDD11')
Edd_vars

# List all the ID of the of variable in the dataset HFUDD11:\n",
Edd_vars = Dst.get_variables(table_id='HFUDD11')
for id in ['BOPOMR','HERKOMST','HFUDD','Tid','ALDER']:
    print(id)
    values = Edd_vars.loc[Edd_vars.id == id,['values']].values[0,0]
    for value in values:      
        print(f' id = {value["id"]}, text = {value["text"]}')

BOPOMR
 id = 000, text = All Denmark
 id = 084, text = Region Hovedstaden
 id = 101, text = Copenhagen
 id = 147, text = Frederiksberg
 id = 155, text = Dragør
 id = 185, text = Tårnby
 id = 165, text = Albertslund
 id = 151, text = Ballerup
 id = 153, text = Brøndby
 id = 157, text = Gentofte
 id = 159, text = Gladsaxe
 id = 161, text = Glostrup
 id = 163, text = Herlev
 id = 167, text = Hvidovre
 id = 169, text = Høje-Taastrup
 id = 183, text = Ishøj
 id = 173, text = Lyngby-Taarbæk
 id = 175, text = Rødovre
 id = 187, text = Vallensbæk
 id = 201, text = Allerød
 id = 240, text = Egedal
 id = 210, text = Fredensborg
 id = 250, text = Frederikssund
 id = 190, text = Furesø
 id = 270, text = Gribskov
 id = 260, text = Halsnæs
 id = 217, text = Helsingør
 id = 219, text = Hillerød
 id = 223, text = Hørsholm
 id = 230, text = Rudersdal
 id = 400, text = Bornholm
 id = 411, text = Christiansø
 id = 085, text = Region Sjælland
 id = 253, text = Greve
 id = 259, text = Køge
 id = 350, text = Lejre
 id = 265, text = Roskilde
 id = 269, text = Solrød
 id = 320, text = Faxe
 id = 376, text = Guldborgsund
 id = 316, text = Holbæk
 id = 326, text = Kalundborg
 id = 360, text = Lolland
 id = 370, text = Næstved
 id = 306, text = Odsherred
 id = 329, text = Ringsted
 id = 330, text = Slagelse
 id = 340, text = Sorø
 id = 336, text = Stevns
 id = 390, text = Vordingborg
 id = 083, text = Region Syddanmark
 id = 420, text = Assens
 id = 430, text = Faaborg-Midtfyn
 id = 440, text = Kerteminde
 id = 482, text = Langeland
 id = 410, text = Middelfart
 id = 480, text = Nordfyns
 id = 450, text = Nyborg
 id = 461, text = Odense
 id = 479, text = Svendborg
 id = 492, text = Ærø
 id = 530, text = Billund
 id = 561, text = Esbjerg
 id = 563, text = Fanø
 id = 607, text = Fredericia
 id = 510, text = Haderslev
 id = 621, text = Kolding
 id = 540, text = Sønderborg
 id = 550, text = Tønder
 id = 573, text = Varde
 id = 575, text = Vejen
 id = 630, text = Vejle
 id = 580, text = Aabenraa
 id = 082, text = Region Midtjylland
 id = 710, text = Favrskov
 id = 766, text = Hedensted
 id = 615, text = Horsens
 id = 707, text = Norddjurs
 id = 727, text = Odder
 id = 730, text = Randers
 id = 741, text = Samsø
 id = 740, text = Silkeborg
 id = 746, text = Skanderborg
 id = 706, text = Syddjurs
 id = 751, text = Aarhus
 id = 657, text = Herning
 id = 661, text = Holstebro
 id = 756, text = Ikast-Brande
 id = 665, text = Lemvig
 id = 760, text = Ringkøbing-Skjern
 id = 779, text = Skive
 id = 671, text = Struer
 id = 791, text = Viborg
 id = 081, text = Region Nordjylland
 id = 810, text = Brønderslev
 id = 813, text = Frederikshavn
 id = 860, text = Hjørring
 id = 849, text = Jammerbugt
 id = 825, text = Læsø
 id = 846, text = Mariagerfjord
 id = 773, text = Morsø
 id = 840, text = Rebild
 id = 787, text = Thisted
 id = 820, text = Vesthimmerlands
 id = 851, text = Aalborg
HERKOMST
 id = TOT, text = Total
 id = 5, text = Persons of Danish origin
 id = 4, text = Immigrants
 id = 3, text = Descendant
HFUDD
 id = TOT, text = Total
 id = H10, text = H10 Primary education
 id = H1001, text = H1001 No education
 id = H1010, text = H1010 Primary school through to 6th grade
 id = H1020, text = H1020 Primary school 7th-9th grade
 id = H1030, text = H1030 Primary school 10th grade
 id = H20, text = H20 Upper secondary education
 id = H2010, text = H2010 Upper secondary education, General (stx, hf, student courses)
 id = H2020, text = H2020 Upper secondary education, General (hhx, htx)
 id = H2030, text = H2030 International upper secondary education
 id = H30, text = H30 Vocational Education and Training (VET)
 id = H3010, text = H3010 Care, health and education (OSP)
 id = H3015, text = H3015 Office, commercial and business services (KHF)
 id = H3020, text = H3020 Food etc. (FJO)
 id = H3025, text = H3025 Agriculture and nature (FJO)
 id = H3030, text = H3030 Experience and events (FJO)
 id = H3035, text = H3035 Construction (TBT)
 id = H3040, text = H3040 The technology area, power and electronics etc. (TBT)
 id = H3045, text = H3045 The technology area, graphical techniques and media production (TBT)
 id = H3050, text = H3050 The technology area, cycling, automotive and marine mechanics etc. (TBT)
 id = H3055, text = H3055 The technology area, mechanical engineering and production (TBT)
 id = H3060, text = H3060 Technical and industrial education in general (TBT)
 id = H3065, text = H3065 Transport and logistics (TBT)
 id = H3090, text = H3090 Other vocational educations
 id = H3097, text = H3097 H3097 Vocational education not specified, VET
 id = H35, text = H35 Qualifying educational programs
 id = H3510, text = H3510 Access courses - higher edu.
 id = H3520, text = H3520 Access Exams - engineering education
 id = H3530, text = H3530 Qualifying workshop schooling
 id = H40, text = H40 Short cycle higher education
 id = H4020, text = H4020 Educational, SCE
 id = H4024, text = H4024 Media and Communication, SCE
 id = H4025, text = H4025 Humanities and theological, SCE
 id = H4030, text = H4030 Arts, SCE
 id = H4038, text = H4038 Social science, Economics-Mercantile, SCE
 id = H4058, text = H4058 Technical educations, SCE
 id = H4075, text = H4075 Food, biotechnology and laboratory technology, SCE
 id = H4080, text = H4080 Agriculture, nature and environment, SCE
 id = H4085, text = H4085 Maritime, SCE
 id = H4089, text = H4089 Health, SCE
 id = H4095, text = H4095 Police, armed forces etc., SCE
 id = H4097, text = H4097 Higher education not specified, SCE
 id = H50, text = H50 Vocational bachelors educations
 id = H5020, text = H5020 Educational, VBE
 id = H5024, text = H5024 Media and Communication, VBE
 id = H5025, text = H5025 Humanities and theological, VBE
 id = H5030, text = H5030 Arts, VBE
 id = H5038, text = H5038 Social science, Economics-Mercantile, VBE
 id = H5039, text = H5039 Social Sciences, VBE
 id = H5058, text = H5058 Technical educations, VBE
 id = H5059, text = H5059 Technical sciences, VBE
 id = H5075, text = H5075 Food, biotechnology and laboratory technology, VBE
 id = H5080, text = H5080 Agriculture, nature and environment, VBE
 id = H5085, text = H5085 Maritime, VBE
 id = H5089, text = H5089 Health, VBE
 id = H5095, text = H5095 Police, armed forces etc., VBE
 id = H5097, text = H5097 Higher education not specified, VBE
 id = H60, text = H60 Bachelors programs
 id = H6020, text = H6020 Educational, BACH
 id = H6025, text = H6025 Humanities and theological, BACH
 id = H6030, text = H6030 Arts, BACH
 id = H6035, text = H6035 Science, BACH
 id = H6039, text = H6039 Social Sciences, BACH
 id = H6059, text = H6059 Technical sciences, BACH
 id = H6075, text = H6075 Food, biotechnology and laboratory technology, BACH
 id = H6080, text = H6080 Agriculture, nature and environment, BACH
 id = H6090, text = H6090 Health science, BACH
 id = H6097, text = H6097 Higher education not specified, BACH
 id = H70, text = H70 Masters programs
 id = H7020, text = H7020 Educational, MASTER
 id = H7025, text = H7025 Humanities and theological, MASTER
 id = H7030, text = H7030 Arts, MASTER
 id = H7035, text = H7035 Science, MASTER
 id = H7039, text = H7039 Social Sciences, MASTER
 id = H7059, text = H7059 Technical sciences, MASTER
 id = H7075, text = H7075 Food, biotechnology and laboratory technology, MASTER
 id = H7080, text = H7080 Agriculture, nature and environment, MASTER
 id = H7090, text = H7090 Health science, MASTER
 id = H7095, text = H7095 Police, armed forces etc., MASTER
 id = H7097, text = H7097 Higher education not specified, MASTER
 id = H80, text = H80 PhD programs
 id = H8020, text = H8020 Educational, PhD
 id = H8025, text = H8025 Humanities and theological PhD
 id = H8030, text = H8030 Arts, PhD
 id = H8035, text = H8035 Science, PhD
 id = H8039, text = H8039 Social Sciences, PhD
 id = H8059, text = H8059 Technical sciences, PhD
 id = H8080, text = H8080 PhD programmes
 id = H8090, text = H8090 Health science, PhD
 id = H8097, text = H8097 Higher education not specified, PhD
 id = H90, text = H90 Not stated
 id = H9099, text = H9099 Not stated
Tid
 id = 2008, text = 2008
 id = 2009, text = 2009
 id = 2010, text = 2010
 id = 2011, text = 2011
 id = 2012, text = 2012
 id = 2013, text = 2013
 id = 2014, text = 2014
 id = 2015, text = 2015
 id = 2016, text = 2016
 id = 2017, text = 2017
 id = 2018, text = 2018
 id = 2019, text = 2019
 id = 2020, text = 2020
ALDER
 id = TOT, text = Age, total
 id = 15-19, text = 15-19 years
 id = 20-24, text = 20-24 years
 id = 25-29, text = 25-29 years
 id = 30-34, text = 30-34 years
 id = 35-39, text = 35-39 years
 id = 40-44, text = 40-44 years
 id = 45-49, text = 45-49 years
 id = 50-54, text = 50-54 years
 id = 55-59, text = 55-59 years
 id = 60-64, text = 60-64 years
 id = 65-69, text = 65-69 years

In [137]:
# Using the IDs from the previous table we get the data
variables_2 = {'BOPOMR':['*'],'HERKOMST':['*'],'HFUDD':['H10','H20','H30','H40','H50','H60','H70','H80'],'Tid':['*'],'KØN':['*'],'ALDER':['TOT']}
edu_api = Dst.get_data(table_id = 'HFUDD11', variables=variables_2)
edu_api.head(50)

,BOPOMR,HERKOMST,HFUDD,TID,KØN,ALDER,INDHOLD
0,Haderslev,Persons of Danish origin,H80 PhD programs,2008,Women,"Age, total",5
1,Haderslev,Persons of Danish origin,H80 PhD programs,2008,Men,"Age, total",15
2,Haderslev,Persons of Danish origin,H80 PhD programs,2008,Total,"Age, total",20
3,Billund,Total,H10 Primary education,2008,Women,"Age, total",3565
4,Billund,Total,H10 Primary education,2008,Men,"Age, total",3489
5,Billund,Total,H10 Primary education,2008,Total,"Age, total",7054
6,Langeland,Persons of Danish origin,H40 Short cycle higher education,2008,Women,"Age, total",63
7,Langeland,Persons of Danish origin,H40 Short cycle higher education,2008,Men,"Age, total",148
8,Langeland,Persons of Danish origin,H40 Short cycle higher education,2008,Total,"Age, total",211
9,Langeland,Persons of Danish origin,H50 Vocational bachelors educations,2008,Women,"Age, total",567
10,Langeland,Persons of Danish origin,H50 Vocational bachelors educations,2008,Men,"Age, total",297
11,Langeland,Persons of Danish origin,H50 Vocational bachelors educations,2008,Total,"Age, total",864
12,Haderslev,Total,H40 Short cycle higher education,2008,Women,"Age, total",535
13,Haderslev,Total,H40 Short cycle higher education,2008,Men,"Age, total",861
14,Haderslev,Total,H40 Short cycle higher education,2008,Total,"Age, total",1396
15,Billund,Total,H20 Upper secondary education,2008,Women,"Age, total",545
16,Billund,Total,H20 Upper secondary education,2008,Men,"Age, total",402
17,Billund,Total,H20 Upper secondary education,2008,Total,"Age, total",947
18,Billund,Total,H30 Vocational Education and Training (VET),2008,Women,"Age, total",2878
19,Billund,Total,H30 Vocational Education and Training (VET),2008,Men,"Age, total",3949
20,Billund,Total,H30 Vocational Education and Training (VET),2008,Total,"Age, total",6827
21,Sønderborg,Total,H40 Short cycle higher education,2008,Women,"Age, total",806
22,Sønderborg,Total,H40 Short cycle higher education,2008,Men,"Age, total",1681
23,Sønderborg,Total,H40 Short cycle higher education,2008,Total,"Age, total",2487
24,Langeland,Persons of Danish origin,H60 Bachelors programs,2008,Women,"Age, total",18
25,Langeland,Persons of Danish origin,H60 Bachelors programs,2008,Men,"Age, total",13
26,Langeland,Persons of Danish origin,H60 Bachelors programs,2008,Total,"Age, total",31
27,Langeland,Persons of Danish origin,H70 Masters programs,2008,Women,"Age, total",62
28,Langeland,Persons of Danish origin,H70 Masters programs,2008,Men,"Age, total",84
29,Langeland,Persons of Danish origin,H70 Masters programs,2008,Total,"Age, total",146
30,Haderslev,Total,H50 Vocational bachelors educations,2008,Women,"Age, total",3324
31,Haderslev,Total,H50 Vocational bachelors educations,2008,Men,"Age, total",1567
32,Haderslev,Total,H50 Vocational bachelors educations,2008,Total,"Age, total",4891
33,Billund,Total,H40 Short cycle higher education,2008,Women,"Age, total",308
34,Billund,Total,H40 Short cycle higher education,2008,Men,"Age, total",432
35,Billund,Total,H40 Short cycle higher education,2008,Total,"Age, total",740
36,Sønderborg,Total,H50 Vocational bachelors educations,2008,Women,"Age, total",4269
37,Sønderborg,Total,H50 Vocational bachelors educations,2008,Men,"Age, total",2568
38,Sønderborg,Total,H50 Vocational bachelors educations,2008,Total,"Age, total",6837
39,Langeland,Persons of Danish origin,H80 PhD programs,2008,Women,"Age, total",4
40,Langeland,Persons of Danish origin,H80 PhD programs,2008,Men,"Age, total",4
41,Langeland,Persons of Danish origin,H80 PhD programs,2008,Total,"Age, total",8
42,Ærø,Total,H10 Primary education,2008,Women,"Age, total",788
43,Ærø,Total,H10 Primary education,2008,Men,"Age, total",685
44,Ærø,Total,H10 Primary education,2008,Total,"Age, total",1473
45,Ærø,Total,H20 Upper secondary education,2008,Women,"Age, total",98
46,Ærø,Total,H20 Upper secondary education,2008,Men,"Age, total",73
47,Ærø,Total,H20 Upper secondary education,2008,Total,"Age, total",171
48,Haderslev,Total,H60 Bachelors programs,2008,Women,"Age, total",104
49,Haderslev,Total,H60 Bachelors programs,2008,Men,"Age, total",102

In [138]:
#Drop colum ALDER and KØN
drop_these = ['ALDER','KØN']
edu_api.drop(drop_these ,axis=1,inplace=True)
edu_api.head(50)

,BOPOMR,HERKOMST,HFUDD,TID,INDHOLD
0,Haderslev,Persons of Danish origin,H80 PhD programs,2008,5
1,Haderslev,Persons of Danish origin,H80 PhD programs,2008,15
2,Haderslev,Persons of Danish origin,H80 PhD programs,2008,20
3,Billund,Total,H10 Primary education,2008,3565
4,Billund,Total,H10 Primary education,2008,3489
5,Billund,Total,H10 Primary education,2008,7054
6,Langeland,Persons of Danish origin,H40 Short cycle higher education,2008,63
7,Langeland,Persons of Danish origin,H40 Short cycle higher education,2008,148
8,Langeland,Persons of Danish origin,H40 Short cycle higher education,2008,211
9,Langeland,Persons of Danish origin,H50 Vocational bachelors educations,2008,567
10,Langeland,Persons of Danish origin,H50 Vocational bachelors educations,2008,297
11,Langeland,Persons of Danish origin,H50 Vocational bachelors educations,2008,864
12,Haderslev,Total,H40 Short cycle higher education,2008,535
13,Haderslev,Total,H40 Short cycle higher education,2008,861
14,Haderslev,Total,H40 Short cycle higher education,2008,1396
15,Billund,Total,H20 Upper secondary education,2008,545
16,Billund,Total,H20 Upper secondary education,2008,402
17,Billund,Total,H20 Upper secondary education,2008,947
18,Billund,Total,H30 Vocational Education and Training (VET),2008,2878
19,Billund,Total,H30 Vocational Education and Training (VET),2008,3949
20,Billund,Total,H30 Vocational Education and Training (VET),2008,6827
21,Sønderborg,Total,H40 Short cycle higher education,2008,806
22,Sønderborg,Total,H40 Short cycle higher education,2008,1681
23,Sønderborg,Total,H40 Short cycle higher education,2008,2487
24,Langeland,Persons of Danish origin,H60 Bachelors programs,2008,18
25,Langeland,Persons of Danish origin,H60 Bachelors programs,2008,13
26,Langeland,Persons of Danish origin,H60 Bachelors programs,2008,31
27,Langeland,Persons of Danish origin,H70 Masters programs,2008,62
28,Langeland,Persons of Danish origin,H70 Masters programs,2008,84
29,Langeland,Persons of Danish origin,H70 Masters programs,2008,146
30,Haderslev,Total,H50 Vocational bachelors educations,2008,3324
31,Haderslev,Total,H50 Vocational bachelors educations,2008,1567
32,Haderslev,Total,H50 Vocational bachelors educations,2008,4891
33,Billund,Total,H40 Short cycle higher education,2008,308
34,Billund,Total,H40 Short cycle higher education,2008,432
35,Billund,Total,H40 Short cycle higher education,2008,740
36,Sønderborg,Total,H50 Vocational bachelors educations,2008,4269
37,Sønderborg,Total,H50 Vocational bachelors educations,2008,2568
38,Sønderborg,Total,H50 Vocational bachelors educations,2008,6837
39,Langeland,Persons of Danish origin,H80 PhD programs,2008,4
40,Langeland,Persons of Danish origin,H80 PhD programs,2008,4
41,Langeland,Persons of Danish origin,H80 PhD programs,2008,8
42,Ærø,Total,H10 Primary education,2008,788
43,Ærø,Total,H10 Primary education,2008,685
44,Ærø,Total,H10 Primary education,2008,1473
45,Ærø,Total,H20 Upper secondary education,2008,98
46,Ærø,Total,H20 Upper secondary education,2008,73
47,Ærø,Total,H20 Upper secondary education,2008,171
48,Haderslev,Total,H60 Bachelors programs,2008,104
49,Haderslev,Total,H60 Bachelors programs,2008,102

In [139]:
#Translate the names of the variable to english
edu_api.rename(columns={'BOPOMR':'municipality','HERKOMST':'origin','TID':'year','HFUDD':'education','INDHOLD':'number of individuals'},inplace=True)
edu_api.head(5)

,municipality,origin,education,year,number of individuals
0,Haderslev,Persons of Danish origin,H80 PhD programs,2008,5
1,Haderslev,Persons of Danish origin,H80 PhD programs,2008,15
2,Haderslev,Persons of Danish origin,H80 PhD programs,2008,20
3,Billund,Total,H10 Primary education,2008,3565
4,Billund,Total,H10 Primary education,2008,3489

In [140]:
# Using the IDs from the previous table we get the data
variables_2 = {'BOPOMR':['*'],'HERKOMST':['TOT'],'HFUDD':['TOT','H70','H80'],'Tid':['2019'],'KØN':['TOT'],'ALDER':['TOT']}
edu_api = Dst.get_data(table_id = 'HFUDD11', variables=variables_2)
edu_api.head(5)

,BOPOMR,HERKOMST,HFUDD,TID,KØN,ALDER,INDHOLD
0,All Denmark,Total,H70 Masters programs,2019,Total,"Age, total",419094
1,All Denmark,Total,H80 PhD programs,2019,Total,"Age, total",37792
2,All Denmark,Total,Total,2019,Total,"Age, total",4040015
3,Region Nordjylland,Total,H70 Masters programs,2019,Total,"Age, total",27756
4,Region Nordjylland,Total,H80 PhD programs,2019,Total,"Age, total",2023

In [147]:
#total
total =  edu_api['HFUDD']=='Total'
print(total.head())
df_total=edu_api[total].groupby(['BOPOMR'])['INDHOLD'].sum().reset_index(name='sumtotal')

#highly
highly =  (edu_api['HFUDD']=='H70 Masters programs') | (edu_api['HFUDD']=='H80 PhD programs')
print(highly.head())
df_highly=edu_api[highly].groupby(['BOPOMR'])['INDHOLD'].sum().reset_index(name='sumhighly')

together = pd.merge(df_total, df_highly, on=['BOPOMR'], how='left')
together['highly_educ']=together['sumhighly']/together['sumtotal']


together.rename(columns = {'BOPOMR':'municipality'}, inplace=True)
together.head(10)

0    False
1    False
2     True
3    False
4    False
Name: HFUDD, dtype: bool
0     True
1     True
2    False
3     True
4     True
Name: HFUDD, dtype: bool

  municipality  sumtotal  sumhighly  highly_educ
0     Aabenraa     39525       1851     0.046831
1      Aalborg    156291      18722     0.119789
2       Aarhus    260373      45203     0.173609
3  Albertslund     18997       1419     0.074696
4  All Denmark   4040015     456886     0.113090
5      Allerød     16613       3417     0.205682
6       Assens     27511       1334     0.048490
7     Ballerup     32207       3471     0.107772
8      Billund     17906        839     0.046856
9     Bornholm     25974       1202     0.046277

## Explore data set

In order to be able to **explore the raw data**, we here provide an **interactive plot** to show, respectively, the employment and income level in each municipality

The **static plot** is:

In [ ]:
def plot_empl_inc(school,dataset,municipality): 
    
    dataset == 'School'
    df = school_final
    y = 'employment'

    
    I = df['municipality'] == municipality
    ax = df.loc[I,:].plot(x='year', y=y, style='-o')

The **interactive plot** is:

ADD SOMETHING HERE IF THE READER SHOULD KNOW THAT E.G. SOME MUNICIPALITY IS SPECIAL.

# Merge data sets

We now create a data set with **municpalities which are in both of our data sets**. We can illustrate this **merge** as:

In [ ]:
plt.figure(figsize=(15,7))
v = venn2(subsets = (4, 4, 10), set_labels = ('inc', 'empl'))
v.get_label_by_id('100').set_text('dropped')
v.get_label_by_id('010').set_text('dropped' )
v.get_label_by_id('110').set_text('included')
plt.show()

In [162]:
merged = pd.merge(school_merge, together, how='left',on=['municipality'])
merged = pd.merge(merged, avg_inc, how='left',on=['municipality'])
merged.head()

  municipality       gpa  sumtotal  sumhighly  highly_educ  avg_income
0     Aabenraa  6.127814   39525.0     1851.0     0.046831    305855.0
1      Aalborg  7.013712  156291.0    18722.0     0.119789    310886.0
2       Aarhus  7.140788  260373.0    45203.0     0.173609    327869.0
3  Albertslund  6.063983   18997.0     1419.0     0.074696    295184.0
4      Allerød  7.965370   16613.0     3417.0     0.205682    437980.0

In [169]:
print(f'Municipalities in school_merge = {len(school_merge.municipality.unique())}')
print(f'Municipalities in together = {len(together.municipality.unique())}')
print(f'Municipalities in avg_inc = {len(avg_inc.municipality.unique())}')

print(f'Number of municipalities = {len(merged.municipality.unique())}')
diff_m = [m for m in merged.municipality.unique() if m not in together.municipality.unique()] 
print(f'Municipalities in merged data, but not in education data: {diff_m}')
diff_2 = [m for m in merged.municipality.unique() if m not in avg_inc.municipality.unique()] 
print(f'Municipalities in merged data, but not in income data: {diff_2}')

print(f'Municipalities in merged = {len(merged.municipality.unique())}')

Municipalities in school_merge = 98
Municipalities in together = 105
Municipalities in avg_inc = 109
Number of municipalities = 98
Municipalities in merged data, but not in education data: ['København']
Municipalities in merged data, but not in income data: ['Christiansø', 'København']
Municipalities in merged = 98

# Analysis

To get a quick overview of the data, we show some **summary statistics by year**:

In [ ]:
.groupby('year').agg(['mean','std']).round(2)
titanic.groupby(["Sex", "Pclass"])["Fare"].mean()

ADD FURTHER ANALYSIS. EXPLAIN THE CODE BRIEFLY AND SUMMARIZE THE RESULTS.

# Conclusion

ADD CONCISE CONLUSION.